# Handling missing values

In [40]:
import pandas as pd

In [80]:
data = pd.read_csv('http://bit.ly/uforeports')

In [81]:
data.tail()

              City Colors Reported Shape Reported State              Time
18236   Grant Park             NaN       TRIANGLE    IL  12/31/2000 23:00
18237  Spirit Lake             NaN           DISK    IA  12/31/2000 23:00
18238  Eagle River             NaN            NaN    WI  12/31/2000 23:45
18239  Eagle River             RED          LIGHT    WI  12/31/2000 23:45
18240         Ybor             NaN           OVAL    FL  12/31/2000 23:59

In [84]:
data.isnull().tail()

        City  Colors Reported  Shape Reported  State   Time
18236  False             True           False  False  False
18237  False             True           False  False  False
18238  False             True            True  False  False
18239  False            False           False  False  False
18240  False             True           False  False  False

In [85]:
data.notnull().tail()

       City  Colors Reported  Shape Reported  State  Time
18236  True            False            True   True  True
18237  True            False            True   True  True
18238  True            False           False   True  True
18239  True             True            True   True  True
18240  True            False            True   True  True

In [86]:
data.isnull().sum()

City                  25
Colors Reported    15359
Shape Reported      2644
State                  0
Time                   0
dtype: int64

In [87]:
data.shape

(18241, 5)

In [88]:
data.dropna(how='any').shape

(2486, 5)

In [89]:
data.shape

(18241, 5)

In [90]:
data.dropna(subset=['City', 'Shape Reported'], how='all').shape

(18237, 5)

In [91]:
data['Colors Reported'].value_counts(dropna=False)

NaN                       15359
RED                         780
GREEN                       531
ORANGE                      528
BLUE                        450
YELLOW                      169
RED GREEN                    89
RED BLUE                     78
RED ORANGE                   44
GREEN BLUE                   34
RED GREEN BLUE               33
ORANGE YELLOW                26
RED YELLOW                   25
ORANGE GREEN                 23
YELLOW GREEN                 17
ORANGE BLUE                  10
RED YELLOW GREEN              9
YELLOW BLUE                   6
ORANGE GREEN BLUE             5
YELLOW GREEN BLUE             5
RED ORANGE YELLOW             4
RED YELLOW GREEN BLUE         4
RED ORANGE BLUE               3
RED YELLOW BLUE               3
RED ORANGE GREEN              3
ORANGE YELLOW BLUE            1
ORANGE YELLOW GREEN           1
RED ORANGE YELLOW BLUE        1
Name: Colors Reported, dtype: int64

In [92]:
data['Colors Reported'].fillna(value='RED YELLOW ORANGE BLUE GREEN', inplace=True)

In [72]:
data['Colors Reported'].value_counts(dropna=False)

RED YELLOW ORANGE BLUE GREEN    15359
RED                               780
GREEN                             531
ORANGE                            528
BLUE                              450
YELLOW                            169
RED GREEN                          89
RED BLUE                           78
RED ORANGE                         44
GREEN BLUE                         34
RED GREEN BLUE                     33
ORANGE YELLOW                      26
RED YELLOW                         25
ORANGE GREEN                       23
YELLOW GREEN                       17
ORANGE BLUE                        10
RED YELLOW GREEN                    9
YELLOW BLUE                         6
ORANGE GREEN BLUE                   5
YELLOW GREEN BLUE                   5
RED ORANGE YELLOW                   4
RED YELLOW GREEN BLUE               4
RED ORANGE BLUE                     3
RED YELLOW BLUE                     3
RED ORANGE GREEN                    3
ORANGE YELLOW BLUE                  1
ORANGE YELLOW GREEN                 1
RED ORANGE YELLOW BLUE              1
Name: Colors Reported, dtype: int64

In [93]:
data2 = pd.read_csv('data/Iris.csv')

In [95]:
data2.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   3            4.7           NaN            1.3           0.2  Iris-setosa
4   4            4.6           3.1            1.5           0.2  Iris-setosa

In [96]:
data2.fillna(method='ffill').head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   3            4.7           3.2            1.3           0.2  Iris-setosa
4   4            4.6           3.1            1.5           0.2  Iris-setosa

In [97]:
data2.fillna(method='bfill').head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   3            4.7           3.1            1.3           0.2  Iris-setosa
4   4            4.6           3.1            1.5           0.2  Iris-setosa

In [98]:
data2.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   3            4.7           NaN            1.3           0.2  Iris-setosa
4   4            4.6           3.1            1.5           0.2  Iris-setosa